from math import factorial, exp

var = [["Андрей", "Маша", "Таня", "Удар Молнии", 12, 100, "Андрей"],
       ["Никита","Серёжа", "Настя", "Оползень", 14, 200, "Никита"],
       ["Соня", "Максим", "Саша", "Ужасная прокрастинация", 8, 300, "Соня"],
       ["Катя", "Таня", "Костя", "Ураган", 17, 400, "Катя"],
       ["Даша", "Игорь", "Кирилл", "Цунами", 24, 300, "Даша"]]

a = int(input("Введите вариант (1-5)\n"))

n = int(input("Введите кол-во дней\n"))

lam = var[a-1][5]/3
m = n*var[a-1][5]/(var[a-1][4])

p = lam**m*exp(-lam)/factorial(m)
print(round(p*100, 3), '%', sep='')
